# coding=utf-8
msg_dict = {
    'admin-bot-start': 'Бот запущен',
    'admin-string': '/send_everyone - Отрпавить сообщение всем рользователям\n\n'
                    '/backup_users_id - Сделать backup базу пользователей бота\n\n'
                    '/bot_stat - Получить статистику бота\n\n'
                    '/update_limitation - Дать безлимит',
    'command-start': 'Привет, с помощью этого бота вы сможете скачать видео и аудио с TikTok.\n'
                     'Отправь ссылку и получи видео, а так же аудио этого видео.',
    'downloaded-by': 'Скачано в @TikTokchekBot',
    'link-wrong': 'Вы отправили неправильную ссылку на пост, пожалуйста, отправьте правильную ссылку.\n\n'
                  'Пример:\n'
                  '1. https://vm.tiktok.com/nq431N/\n'
                  '2. https://www.tiktok.com/@avani/video/6810857914052398342\n',
    'message-wait': 'Пожалуйста, подождите...\n'
                    'Ваше видео уже скачивается',
    'user-invite-link': 'Чтобы начать скачивать видео и аудио с TikTok, '
                        'пригласите одного друга по реферельной ссылке.\n\n'
                        '🔗 https://telegram.me/TikTokchekBot?start={0}\n\n'
                        'Как пригласить?\n\n'
                        '1. Отправляете вашу ссылку другу.\n'
                        '2. Ваш друг должен пройти по ссылке и нажать на старт.\n'
                        '3. Важно, пользователь должен быть новым (до этого он не должен был использовать бот)\n'
                        '4. Скачивайте сколько угодно!',
    'user-invited': '👋 Вы пригласили [{0}](tg://user?id={1})\n'
                    'Теперь вы можете скачивать видео и аудио с TikTok.',
    'unable_download': 'К сожалению, мне не удалось получить информацию об этом видео.\n'
                       'Попробуйте позже или отправьте другую ссылку.',
}
